#+TITLE: Intro to Java Programming
#+AUTHOR: Scott Runnels
#+LANGUAGE: en
#+EXPORT_FILE_NAME: part02d.pdf
#+OPTIONS:   H:2 num:t toc:t \n:nil @:t ::t |:t ^:nil -:nil f:t *:t <:t 
#+BIND: org-latex-caption-above nil
#+LaTeX_CLASS: beamer
#+LaTeX_CLASS_OPTIONS: [presentation]
#+LaTeX_CLASS_OPTIONS: [aspectratio=169]
#+COLUMNS: %45ITEM %10BEAMER_env(Env) %10BEAMER_act(Act) %4BEAMER_col(Col) %8BEAMER_opt(Opt)
#+COLUMNS: %20ITEM %13BEAMER_env(Env) %6BEAMER_envargs(Args) %4BEAMER_col(Col) %7BEAMER_extra(Extra)
#+BEAMER_THEME: metropolis
# #+BEAMER_OUTER_THEME: miniframes [subsection=false]
#+BEAMER_HEADER: \subtitle{Methods}
# #+BEAMER_HEADER: \AtBeginSection[]{
# This line inserts a table of contents with the current section highlighted at
# the beginning of each section
# #+BEAMER_HEADER: \begin{frame}<beamer>\frametitle{Topic}\tableofcontents[currentsection]\end{frame}
# In order to have the miniframes/smoothbars navigation bullets even though we do not use subsections 
# q.v. https://tex.stackexchange.com/questions/2072/beamer-navigation-circles-without-subsections/2078#2078
# #+BEAMER_HEADER: \subsection{}
# #+BEAMER_HEADER: }
#+LATEX_HEADER: \definecolor{myblue}{RGB}{20,105,176}
#+LATEX_HEADER: \usepackage{listings}
#+LATEX_HEADER: \usepackage{minted}
#+LATEX_HEADER: \usepackage[listings, many]{tcolorbox}
#+LATEX_HEADER: \usepackage{tabularx}
#+LATEX_HEADER: \usepackage{etoolbox}
#+LATEX_HEADER: \usepackage{local-style}
#+LATEX_HEADER: \BeforeBeginEnvironment{minted}{\begin{tcolorbox}[enhanced,colframe=myblue,boxrule=1pt,boxsep=1pt,left=1pt,right=1pt,top=-0pt,bottom=0pt,arc=0pt,toprule=0pt, rightrule=0pt,colback=white,attach boxed title to top left={yshift=-0pt},title=Code,boxed title style={colback=myblue, right=0mm, bottomrule=0pt, left=0mm, arc=0pt}, fonttitle=\tiny]}%
#+LATEX_HEADER: \AfterEndEnvironment{minted}{\end{tcolorbox}}%
#+LATEX_HEADER: \usepackage{parskip}
*** 
    #+ATTR_LATEX: :options numbersep=5pt,linenos,breaklines=true,fontsize=\tiny,autogobble=true
    #+begin_src java :exports both :wrap resultscode
      System.out.println("foo");
    #+end_src

    #+RESULTS:
    #+begin_resultscode
    foo
    #+end_resultscode
    #+ATTR_LATEX: :options numbersep=5pt,linenos,breaklines=true,fontsize=\tiny,autogobble=true
    #+begin_src java :exports both :wrap resultscode
      int input = Integer.valueOf("10");
      System.out.println(input);
    #+end_src

    #+RESULTS:
    #+begin_resultscode
    10
    #+end_resultscode

***                                                               :B_onlyenv:
    :PROPERTIES:
    :BEAMER_act: <3>
    :BEAMER_env: onlyenv
    :END:
    #+ATTR_LATEX: :options numbersep=5pt,linenos,breaklines=true,fontsize=\tiny,autogobble=true,highlightlines={9}
    #+begin_src java
      public class Example {
          public static void main(String[] args) {
              greet();
              // program code
          }
          // your own methods here
          public static void greet() {
              System.out.println("Greetings from the method world!");
          }   
      }
    #+end_src

    #+RESULTS:
    : Greetings from the method world!

** Method parameters
   #+ATTR_LATEX: :options numbersep=5pt,linenos,breaklines=true,fontsize=\tiny,highlightlines={1}
   #+begin_src java :exports both :wrap resultscode :session jprint
     public static void greet(int numOfTimes) {
         int i = 0;
         while (i < numOfTimes) {
             System.out.println("Greetings!");
             i++;
         }
     }

     public static void main(String[] args){
         greet(2);
     }
   #+end_src

   #+RESULTS:
   #+begin_resultscode
   Greetings!
   Greetings!
   #+end_resultscode

***                                                          :B_onlyenv:
    :PROPERTIES:
    :BEAMER_env: onlyenv
    :BEAMER_act: <1>
    :END:
    #+ATTR_LATEX: :options numbersep=5pt,linenos,breaklines=true,fontsize=\tiny    
    #+begin_src java :exports code :wrap resultscode :exports code
      public static void main(String[] args){
          int x = 10;
          if (x > 10){
              int y = 11;
              System.out.println(x);
              System.out.println(y);
          }
          System.out.println(x);
          // THIS WILL ERROR
          // System.out.println(y); 
      }

    #+end_src

    #+RESULTS:
    #+begin_resultscode
    10
    #+end_resultscode

***                                                               :B_onlyenv:
    :PROPERTIES:
    :BEAMER_env: onlyenv
    :BEAMER_act: <2>
    :END:
    #+ATTR_LATEX: :options numbersep=5pt,linenos,breaklines=true,fontsize=\tiny    
    #+begin_src java :exports code :wrap resultscode :exports both
      public class Example {
          public static void main(String[] args){
              int x = 10;
              int y = 11;
              System.out.println("From inside main: " + x + " " + y);
              sayHi(x, y);
              System.out.println("From inside main: " + x + " " + y);
          }
          public static void sayHi(int x, int y){
              x += 10;
              y += 10;
              System.out.println("From inside sayHi: " + x + " " + y);
          }
      }
    #+end_src

    #+RESULTS:
    #+begin_resultscode
    From inside main: 10 11
    From inside sayHi: 20 21
    From inside main: 10 11
    #+end_resultscode

